app/controllers/expressions_controller.rb

SELECT "expressions".* FROM "expressions"
---
  def index
    @expressions = Expression.all

UPDATE "expressions" SET "sentence" = $1, "updated_at" = $2 WHERE "expressions"."id" = $3  [["sentence", "Hacer el perro muerto"], ["updated_at", "2022-06-07 15:54:42.903543"], ["id", 95]]
---
  def update
    respond_to do |format|
      if @expression.update(expression_params)

SELECT "expressions".* FROM "expressions" WHERE "expressions"."id" = $1 LIMIT $2  [["id", 95], ["LIMIT", 1]]
---
    def set_expression
      @expression = Expression.find(params[:id])